const dependentOriginData = {
    "name": "十二缘起",
    factors: [
        {
            id: 1,
            name: "无明",
            note: "无知，属于痴心所，覆盖对诸法实相的觉知能力。无知四圣谛、过去、未来、过去未来、此缘性、缘起诸法。",
            wheel: "烦恼",
            nama: [{
                type: "心所",
                name: "痴心所"
            }],
            rupa: [],
            class: "因",
            time: "过去",
            conditioning: {
                id: 2,
                note: "当有情受到无明影响时，「行」即会制造能产生未来世的业。因此无明被称为产生行的主要缘。无明在不善业中很明显，而在世间善业里则是潜伏性的存在。所以世间善与不善行两者皆被说缘于无明。",
            }
        },
        {
            id: 2,
            name: "诸行",
            wheel: "业",
            note: "是29种世间善与不善心（速行）相应的思心所",
            class: "因",
            time: "过去",
            connection: "行识",
            nama: [
                {
                    type: "心所",
                    name: "12不善心思心所",
                    note: "称为非福行"
                },
                {
                    type: "心所",
                    name: "8大+5色界善心思心所",
                    note: "称为福行"
                },
                {
                    type: "心所",
                    name: "4无色界善心思心所",
                    note: "称不动行(无色之报)"
                }],
            rupa: [],
            conditioning: {
                id: 3,
                note: "源于「诸行」而「识」升起。在上一世死时，最后一个速行会在下一世与该业相符之地产生19种结生心之一。在随后的生命期间，过往所积累的业也能产生果报心。",
            }
        },
        {
            id: 3,
            name: "识",
            note: "32种世间果报心（结生及路心）",
            class: "果",
            time: "现在",
            wheel: "果报",
            connection: "受爱",
            nama: [
                {
                    "type": "心",
                    "name": "7不善无因心",
                },
                {
                    "type": "心",
                    "name": "8善无因心",
                },
                {
                    "type": "心",
                    "name": "8大善果报心",
                },
                {
                    "type": "心",
                    "name": "5色界果报心",
                },
                {
                    "type": "心",
                    "name": "4无色界果报心",
                }
            ],
            rupa: [],
            conditioning: {
                id: 4,
                note: "具有「五蕴有」的众生，「识」缘生名色两者；无色界天属于「四蕴有」，识只能缘生名法；无想有情天是属于「一蕴有」,前世的识只缘生无想天的色法，不能缘生名法。",
            }
        },
        {
            id: 4,
            name: "名色",
            class: "果",
            time: "现在",
            wheel: "果报",
            nama: [
                {
                    type: "心",
                    name: "果报心"
                },
                {
                    type: "心所",
                    name: "诸心",
                    note: "人类为受想行三名蕴"
                }
            ],
            rupa: [{
                name: "业生色",
                note: "人类为三个十法聚"
            }],
            note: "名是果报心及其相应的诸心所。色是业生色。",
            conditioning: {
                id: 5,
                note: "当业生色生起时，它们缘助也是属于业生色的五净色生起。当诸相应心所生起时，它们缘助于此称为意处的果报心升起。亦即果报心缘生名，而名缘生果报心，它们是相互缘。在欲界，缘生所有六处；在色界，名色只缘生眼耳意三处；无色界只有意处。",
            }
        },
        {
            id: 5,
            name: "六处",
            note: "五净色和32种世间果报心。",
            class: "果",
            time: "现在",
            wheel: "果报",
            nama: [
                {
                    type: "心",
                    name: "7不善无因心"
                },
                {
                    type: "心",
                    name: "8善无因心"
                },
                {
                    type: "心",
                    name: "8大善果报心"
                },
                {
                    type: "心",
                    name: "5色界果报心"
                },
                {
                    type: "心",
                    name: "4无色界果报心"
                }
            ],
            rupa: [{
                name: "五净色",
                note: "眼、耳、鼻、舌、身"
            }],
            conditioning: {
                id: 6,
                note: "触必须有处才能生起，所以说缘于六处而触生起。",
            }
        },
        {
            id: 6,
            name: "触",
            note: "触是心、心所、目标聚集六处之一处的触击。起于眼处的称为「眼触」，它是眼净色、色所缘、及眼识聚集于一处；其余四处以此类推。「意触」是与双五识之外的22果报心相应的'触'。",
            class: "果",
            time: "现在",
            wheel: "果报",
            nama: [
                {
                    type: "心所",
                    name: "眼触",
                    note: "与眼识相应的触心所"
                },
                {
                    type: "心所",
                    name: "耳触",
                    note: "与耳识相应的触心所"
                },
                {
                    type: "心所",
                    name: "鼻触",
                    note: "与鼻识相应的触心所"
                },
                {
                    type: "心所",
                    name: "舌触",
                    note: "与舌识相应的触心所"
                },
                {
                    type: "心所",
                    name: "身触",
                    note: "与身识相应的触心所"
                },
                {
                    type: "心所",
                    name: "意触",
                    note: "其他果报心的触心所"
                }],
            rupa: [],
            conditioning: {
                id: 7,
                note: "缘于六触生六种受，如眼触生受、耳触生受等。新造的忧受、悦受、舍受是伴随'爱'或'业有'生起，不归属于此「受」",
            }
        },
        {
            id: 7,
            name: "受",
            class: "果",
            time: "现在",
            wheel: "果报",
            connection: "受爱",
            nama: [{
                type: "心所",
                name: "受",
                note: "32种世间果报心之受"
            }],
            rupa: [],
            note: "在此「受」特指32种世间果报心之受。",
            conditioning: {
                id: 8,
                note: "爱是贪心所，缘于受。",
            }
        },
        {
            id: 8,
            name: "爱",
            wheel: "烦恼",
            nama: [{
                type: "心所",
                name: "贪"
            }],
            rupa: [],
            note: "有六种：色爱声爱香爱味爱触爱法爱。也可以分为三种：渴爱欲乐；渴爱生存，含有常见的渴爱；渴爱断灭，即含有断见的渴爱。",
            class: "因",
            time: "现在",
            connection: "受爱",
            conditioning: {
                id: 9,
                note: "四种取都是缘于爱——若无爱、取二支则直至'业有'",
            }
        },
        {
            id: 9,
            name: "取",
            time: "现在",
            wheel: "烦恼",
            nama: [{
                type: "心所",
                name: "贪",
                note: "欲取是贪爱的强化"
            }, {
                type: "心所",
                name: "邪见",
                note: "邪见取、戒禁取、我语取"
            }],
            rupa: [],
            note: "有四种：欲取、邪见取、戒禁取、我语取。",
            class: "因",
            conditioning: {
                id: 10,
                note: "「取」是「业有」的缘，因为「取」人们才会「造业」；「取」亦是「生有」的缘，因为「取」，才会导致人们依照自己所造的业一再地生死轮回。",
            }
        },
        {
            id: 10,
            name: "有",
            note: "（存在）有两种：「业有」与「生有」。「业有」是29种善与不善思（福行、非福行、不动行）。「生有」包括32种果报心、它们的相应心所及业生色。业有属于五因、三转轮中的业。",
            class: "因",
            time: "现在",
            connection: "受爱",
            wheel: "业/果",
            nama: [{
                type: "心所",
                name: "思",
                note: "思心所造业，属于业有"
            }, {
                type: "心",
                name: "32果报心",
                note: "生有的一部分"
            }, {
                type: "心所",
                name: "32果报心对应心所",
                note: "生有的一部分"
            }],
            rupa: [{
                name: "业生色",
                note: "生有的一部分"
            }],
            conditioning: {
                id: 11,
                note: "未来世产生是缘于「业有」",
            }
        },
        {
            id: 11,
            name: "生",
            connection: "有生",
            time: "未来",
            nama: [],
            rupa: [],
            note: "生于下一世投生所在地的世间果报心、相应心所、业生色（诸蕴显现、诸蕴获得）",
            conditioning: {
                id: 12,
                note: "生一旦产生，老、死势必无法避免。在生与死之间也可能会生起其他苦，如愁、悲、苦、忧、恼。这些苦的根源是生，所以把生列为它们的主要缘。",
            }
        },
        {
            id: 12,
            name: "老死",
            time: "未来",
            note: "诸根日坏、诸蕴崩裂、命根全断。",
            nama: [],
            rupa: [],
            conditioning: {
            }
        },
    ],
};
